


// let string = "alloha"//Строковый тип данных
// //let-неявное обьявление переменной
// //string Имя переменной
// // = присвоение значение переменной
// //"alloha -значение переменной"
// alert(string)//Всплывающее окно на сайте


// let integer = 10//Целчисленный тип данных
// console.log(integer) //Вывод текста в консоль сайта


// let float =10.1//Число с плавающей точкой
// let boolean = true //true-1 false-0


// #####################################################################
//  let num = prompt("Введите число для возведения в квадрат")
//  //во внутрь переменной num мы передаем функцию prompt
//  //далее будет возводить в квадрат

//  num = num **2

//  // + сложение (num = num + 1)-значение переменной увеличится на 1 по аналогии с вычитанием, умножением и делением 
//  // -вычитание (num= num-1)
//  // *умножение (num = num * 1)
//  // / - деление (num = num / 1)
//  // % - взятие остатка от деления (num=num % 3) - остаток от деления на 3
//  //Мы изменили переменную num и возвели ее значение в квадрат (во вторую степень)

//  alert(num)
//  //выводит значение переменной num на экран
// #####################################################################
// let num_First = Number (prompt("Введите первое число"))
// let num_Second = Number(prompt("Введите второе число"))


// let mid = (num_First + num_Second) / 2
// alert(mid)
//  #########################################################
// let num_First =  Number (prompt("Введите длину стороны квадрата"))
// num = num_First **2 
// alert(num)


